// Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
Console.Clear ();
Console.Write("a:");
int a = int.Parse(Console.ReadLine());
Console.Write("b:");
int b = int.Parse(Console.ReadLine());
Console.Write("c:");
int c = int.Parse(Console.ReadLine());
max = a;

if(a > b); (a > c);
{
    Console.WriteLine($"максимальное значение {max}");
}
max = b;
If (b > c);
{
      Console.WriteLine($"максимальное значение {max}");
}
max = c;
Console.WriteLine($"максимальное значение {max}");
