// Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
Console.Clear ();
Console.Write("a:");
int a = int.Parse(Console.ReadLine());
Console.Write("b:");
int b = int.Parse(Console.ReadLine());
Console.Write("c:");
int c = int.Parse(Console.ReadLine());
max = a;
if (max > b)
{ 
    max > c;
}max == b;
If (max > c);
{
    Console.WriteLine($"амксимальное значение {max}");
}max == c;
    
Console.WriteLine($"большее значение {max}");